code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналИсходящихСообщенийKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналИсходящихСообщенийKafka</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Ключ (key) сообщения Kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтправкиСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправляемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.УслугиДепозитария</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаНачисленныхКомиссий</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешнийИсточник</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналИсходящихСообщенийKafka/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьВыделенныеСообщения(Команда)
	Для Каждого Сообщение Из Элементы.Список.ВыделенныеСтроки Цикл
		ОтправитьВыделенныеСообщенияНаСервере(Сообщение);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОтправитьВыделенныеСообщенияНаСервере(Сообщение)
    СтруктураПоиска = Новый Структура("Идентификатор", Сообщение.Идентификатор);
	Данные = РегистрыСведений.ЖурналИсходящихСообщенийKafka.Выбрать(СтруктураПоиска);
    Если Данные.Следующий() Тогда
		КафкаКлиент = Обработки.KafkaClient.Создать();
		Ответ = КафкаКлиент.РезультатОтправкиСообщенияПоВнешнемуИсточнику(Данные);
		ДатаОтправки = ТекущаяДатаСеанса();
		МенеджерЗаписи = Данные.ПолучитьМенеджерЗаписи();
		МенеджерЗаписи.Прочитать();
		Если Ответ = "Persisted" Тогда
			МенеджерЗаписи.Отправлено = Истина;
			МенеджерЗаписи.ПериодОтправкиСообщения = ДатаОтправки;
		Иначе
			МенеджерЗаписи.ОшибкаОтправки = Истина;
			МенеджерЗаписи.ОписаниеОшибки = Ответ;
		КонецЕсли;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры
